#loc = loc(unknown)
module @SyncTensorsGraph.1698 attributes {mhlo.cross_program_prefetches = [], mhlo.input_output_alias = [], mhlo.is_dynamic = false, mhlo.use_auto_spmd_partitioning = false} {
  func.func @main(%arg0: tensor<1000xf32> loc(unknown), %arg1: tensor<1000x2048xf32> loc(unknown), %arg2: tensor<2048xf32> loc(unknown), %arg3: tensor<2048xf32> loc(unknown), %arg4: tensor<2048xf32> loc(unknown), %arg5: tensor<2048xf32> loc(unknown), %arg6: tensor<2048x1024x1x1xf32> loc(unknown), %arg7: tensor<1024xf32> loc(unknown), %arg8: tensor<1024xf32> loc(unknown), %arg9: tensor<1024xf32> loc(unknown), %arg10: tensor<1024xf32> loc(unknown), %arg11: tensor<1024x512x1x1xf32> loc(unknown), %arg12: tensor<512xf32> loc(unknown), %arg13: tensor<512xf32> loc(unknown), %arg14: tensor<512xf32> loc(unknown), %arg15: tensor<512xf32> loc(unknown), %arg16: tensor<512x256x1x1xf32> loc(unknown), %arg17: tensor<256xf32> loc(unknown), %arg18: tensor<256xf32> loc(unknown), %arg19: tensor<256xf32> loc(unknown), %arg20: tensor<256xf32> loc(unknown), %arg21: tensor<256x64x1x1xf32> loc(unknown), %arg22: tensor<64xf32> loc(unknown), %arg23: tensor<64xf32> loc(unknown), %arg24: tensor<64xf32> loc(unknown), %arg25: tensor<64xf32> loc(unknown), %arg26: tensor<64x3x7x7xf32> loc(unknown), %arg27: tensor<1x3x224x224xf32> loc(unknown), %arg28: tensor<256xf32> loc(unknown), %arg29: tensor<256xf32> loc(unknown), %arg30: tensor<256xf32> loc(unknown), %arg31: tensor<256xf32> loc(unknown), %arg32: tensor<256x64x1x1xf32> loc(unknown), %arg33: tensor<64xf32> loc(unknown), %arg34: tensor<64xf32> loc(unknown), %arg35: tensor<64xf32> loc(unknown), %arg36: tensor<64xf32> loc(unknown), %arg37: tensor<64x64x3x3xf32> loc(unknown), %arg38: tensor<64xf32> loc(unknown), %arg39: tensor<64xf32> loc(unknown), %arg40: tensor<64xf32> loc(unknown), %arg41: tensor<64xf32> loc(unknown), %arg42: tensor<64x64x1x1xf32> loc(unknown), %arg43: tensor<256xf32> loc(unknown), %arg44: tensor<256xf32> loc(unknown), %arg45: tensor<256xf32> loc(unknown), %arg46: tensor<256xf32> loc(unknown), %arg47: tensor<256x64x1x1xf32> loc(unknown), %arg48: tensor<64xf32> loc(unknown), %arg49: tensor<64xf32> loc(unknown), %arg50: tensor<64xf32> loc(unknown), %arg51: tensor<64xf32> loc(unknown), %arg52: tensor<64x64x3x3xf32> loc(unknown), %arg53: tensor<64xf32> loc(unknown), %arg54: tensor<64xf32> loc(unknown), %arg55: tensor<64xf32> loc(unknown), %arg56: tensor<64xf32> loc(unknown), %arg57: tensor<64x256x1x1xf32> loc(unknown), %arg58: tensor<256xf32> loc(unknown), %arg59: tensor<256xf32> loc(unknown), %arg60: tensor<256xf32> loc(unknown), %arg61: tensor<256xf32> loc(unknown), %arg62: tensor<256x64x1x1xf32> loc(unknown), %arg63: tensor<64xf32> loc(unknown), %arg64: tensor<64xf32> loc(unknown), %arg65: tensor<64xf32> loc(unknown), %arg66: tensor<64xf32> loc(unknown), %arg67: tensor<64x64x3x3xf32> loc(unknown), %arg68: tensor<64xf32> loc(unknown), %arg69: tensor<64xf32> loc(unknown), %arg70: tensor<64xf32> loc(unknown), %arg71: tensor<64xf32> loc(unknown), %arg72: tensor<64x256x1x1xf32> loc(unknown), %arg73: tensor<512xf32> loc(unknown), %arg74: tensor<512xf32> loc(unknown), %arg75: tensor<512xf32> loc(unknown), %arg76: tensor<512xf32> loc(unknown), %arg77: tensor<512x128x1x1xf32> loc(unknown), %arg78: tensor<128xf32> loc(unknown), %arg79: tensor<128xf32> loc(unknown), %arg80: tensor<128xf32> loc(unknown), %arg81: tensor<128xf32> loc(unknown), %arg82: tensor<128x128x3x3xf32> loc(unknown), %arg83: tensor<128xf32> loc(unknown), %arg84: tensor<128xf32> loc(unknown), %arg85: tensor<128xf32> loc(unknown), %arg86: tensor<128xf32> loc(unknown), %arg87: tensor<128x256x1x1xf32> loc(unknown), %arg88: tensor<512xf32> loc(unknown), %arg89: tensor<512xf32> loc(unknown), %arg90: tensor<512xf32> loc(unknown), %arg91: tensor<512xf32> loc(unknown), %arg92: tensor<512x128x1x1xf32> loc(unknown), %arg93: tensor<128xf32> loc(unknown), %arg94: tensor<128xf32> loc(unknown), %arg95: tensor<128xf32> loc(unknown), %arg96: tensor<128xf32> loc(unknown), %arg97: tensor<128x128x3x3xf32> loc(unknown), %arg98: tensor<128xf32> loc(unknown), %arg99: tensor<128xf32> loc(unknown), %arg100: tensor<128xf32> loc(unknown), %arg101: tensor<128xf32> loc(unknown), %arg102: tensor<128x512x1x1xf32> loc(unknown), %arg103: tensor<512xf32> loc(unknown), %arg104: tensor<512xf32> loc(unknown), %arg105: tensor<512xf32> loc(unknown), %arg106: tensor<512xf32> loc(unknown), %arg107: tensor<512x128x1x1xf32> loc(unknown), %arg108: tensor<128xf32> loc(unknown), %arg109: tensor<128xf32> loc(unknown), %arg110: tensor<128xf32> loc(unknown), %arg111: tensor<128xf32> loc(unknown), %arg112: tensor<128x128x3x3xf32> loc(unknown), %arg113: tensor<128xf32> loc(unknown), %arg114: tensor<128xf32> loc(unknown), %arg115: tensor<128xf32> loc(unknown), %arg116: tensor<128xf32> loc(unknown), %arg117: tensor<128x512x1x1xf32> loc(unknown), %arg118: tensor<512xf32> loc(unknown), %arg119: tensor<512xf32> loc(unknown), %arg120: tensor<512xf32> loc(unknown), %arg121: tensor<512xf32> loc(unknown), %arg122: tensor<512x128x1x1xf32> loc(unknown), %arg123: tensor<128xf32> loc(unknown), %arg124: tensor<128xf32> loc(unknown), %arg125: tensor<128xf32> loc(unknown), %arg126: tensor<128xf32> loc(unknown), %arg127: tensor<128x128x3x3xf32> loc(unknown), %arg128: tensor<128xf32> loc(unknown), %arg129: tensor<128xf32> loc(unknown), %arg130: tensor<128xf32> loc(unknown), %arg131: tensor<128xf32> loc(unknown), %arg132: tensor<128x512x1x1xf32> loc(unknown), %arg133: tensor<1024xf32> loc(unknown), %arg134: tensor<1024xf32> loc(unknown), %arg135: tensor<1024xf32> loc(unknown), %arg136: tensor<1024xf32> loc(unknown), %arg137: tensor<1024x256x1x1xf32> loc(unknown), %arg138: tensor<256xf32> loc(unknown), %arg139: tensor<256xf32> loc(unknown), %arg140: tensor<256xf32> loc(unknown), %arg141: tensor<256xf32> loc(unknown), %arg142: tensor<256x256x3x3xf32> loc(unknown), %arg143: tensor<256xf32> loc(unknown), %arg144: tensor<256xf32> loc(unknown), %arg145: tensor<256xf32> loc(unknown), %arg146: tensor<256xf32> loc(unknown), %arg147: tensor<256x512x1x1xf32> loc(unknown), %arg148: tensor<1024xf32> loc(unknown), %arg149: tensor<1024xf32> loc(unknown), %arg150: tensor<1024xf32> loc(unknown), %arg151: tensor<1024xf32> loc(unknown), %arg152: tensor<1024x256x1x1xf32> loc(unknown), %arg153: tensor<256xf32> loc(unknown), %arg154: tensor<256xf32> loc(unknown), %arg155: tensor<256xf32> loc(unknown), %arg156: tensor<256xf32> loc(unknown), %arg157: tensor<256x256x3x3xf32> loc(unknown), %arg158: tensor<256xf32> loc(unknown), %arg159: tensor<256xf32> loc(unknown), %arg160: tensor<256xf32> loc(unknown), %arg161: tensor<256xf32> loc(unknown), %arg162: tensor<256x1024x1x1xf32> loc(unknown), %arg163: tensor<1024xf32> loc(unknown), %arg164: tensor<1024xf32> loc(unknown), %arg165: tensor<1024xf32> loc(unknown), %arg166: tensor<1024xf32> loc(unknown), %arg167: tensor<1024x256x1x1xf32> loc(unknown), %arg168: tensor<256xf32> loc(unknown), %arg169: tensor<256xf32> loc(unknown), %arg170: tensor<256xf32> loc(unknown), %arg171: tensor<256xf32> loc(unknown), %arg172: tensor<256x256x3x3xf32> loc(unknown), %arg173: tensor<256xf32> loc(unknown), %arg174: tensor<256xf32> loc(unknown), %arg175: tensor<256xf32> loc(unknown), %arg176: tensor<256xf32> loc(unknown), %arg177: tensor<256x1024x1x1xf32> loc(unknown), %arg178: tensor<1024xf32> loc(unknown), %arg179: tensor<1024xf32> loc(unknown), %arg180: tensor<1024xf32> loc(unknown), %arg181: tensor<1024xf32> loc(unknown), %arg182: tensor<1024x256x1x1xf32> loc(unknown), %arg183: tensor<256xf32> loc(unknown), %arg184: tensor<256xf32> loc(unknown), %arg185: tensor<256xf32> loc(unknown), %arg186: tensor<256xf32> loc(unknown), %arg187: tensor<256x256x3x3xf32> loc(unknown), %arg188: tensor<256xf32> loc(unknown), %arg189: tensor<256xf32> loc(unknown), %arg190: tensor<256xf32> loc(unknown), %arg191: tensor<256xf32> loc(unknown), %arg192: tensor<256x1024x1x1xf32> loc(unknown), %arg193: tensor<1024xf32> loc(unknown), %arg194: tensor<1024xf32> loc(unknown), %arg195: tensor<1024xf32> loc(unknown), %arg196: tensor<1024xf32> loc(unknown), %arg197: tensor<1024x256x1x1xf32> loc(unknown), %arg198: tensor<256xf32> loc(unknown), %arg199: tensor<256xf32> loc(unknown), %arg200: tensor<256xf32> loc(unknown), %arg201: tensor<256xf32> loc(unknown), %arg202: tensor<256x256x3x3xf32> loc(unknown), %arg203: tensor<256xf32> loc(unknown), %arg204: tensor<256xf32> loc(unknown), %arg205: tensor<256xf32> loc(unknown), %arg206: tensor<256xf32> loc(unknown), %arg207: tensor<256x1024x1x1xf32> loc(unknown), %arg208: tensor<1024xf32> loc(unknown), %arg209: tensor<1024xf32> loc(unknown), %arg210: tensor<1024xf32> loc(unknown), %arg211: tensor<1024xf32> loc(unknown), %arg212: tensor<1024x256x1x1xf32> loc(unknown), %arg213: tensor<256xf32> loc(unknown), %arg214: tensor<256xf32> loc(unknown), %arg215: tensor<256xf32> loc(unknown), %arg216: tensor<256xf32> loc(unknown), %arg217: tensor<256x256x3x3xf32> loc(unknown), %arg218: tensor<256xf32> loc(unknown), %arg219: tensor<256xf32> loc(unknown), %arg220: tensor<256xf32> loc(unknown), %arg221: tensor<256xf32> loc(unknown), %arg222: tensor<256x1024x1x1xf32> loc(unknown), %arg223: tensor<2048xf32> loc(unknown), %arg224: tensor<2048xf32> loc(unknown), %arg225: tensor<2048xf32> loc(unknown), %arg226: tensor<2048xf32> loc(unknown), %arg227: tensor<2048x512x1x1xf32> loc(unknown), %arg228: tensor<512xf32> loc(unknown), %arg229: tensor<512xf32> loc(unknown), %arg230: tensor<512xf32> loc(unknown), %arg231: tensor<512xf32> loc(unknown), %arg232: tensor<512x512x3x3xf32> loc(unknown), %arg233: tensor<512xf32> loc(unknown), %arg234: tensor<512xf32> loc(unknown), %arg235: tensor<512xf32> loc(unknown), %arg236: tensor<512xf32> loc(unknown), %arg237: tensor<512x1024x1x1xf32> loc(unknown), %arg238: tensor<2048xf32> loc(unknown), %arg239: tensor<2048xf32> loc(unknown), %arg240: tensor<2048xf32> loc(unknown), %arg241: tensor<2048xf32> loc(unknown), %arg242: tensor<2048x512x1x1xf32> loc(unknown), %arg243: tensor<512xf32> loc(unknown), %arg244: tensor<512xf32> loc(unknown), %arg245: tensor<512xf32> loc(unknown), %arg246: tensor<512xf32> loc(unknown), %arg247: tensor<512x512x3x3xf32> loc(unknown), %arg248: tensor<512xf32> loc(unknown), %arg249: tensor<512xf32> loc(unknown), %arg250: tensor<512xf32> loc(unknown), %arg251: tensor<512xf32> loc(unknown), %arg252: tensor<512x2048x1x1xf32> loc(unknown), %arg253: tensor<2048xf32> loc(unknown), %arg254: tensor<2048xf32> loc(unknown), %arg255: tensor<2048xf32> loc(unknown), %arg256: tensor<2048xf32> loc(unknown), %arg257: tensor<2048x512x1x1xf32> loc(unknown), %arg258: tensor<512xf32> loc(unknown), %arg259: tensor<512xf32> loc(unknown), %arg260: tensor<512xf32> loc(unknown), %arg261: tensor<512xf32> loc(unknown), %arg262: tensor<512x512x3x3xf32> loc(unknown), %arg263: tensor<512xf32> loc(unknown), %arg264: tensor<512xf32> loc(unknown), %arg265: tensor<512xf32> loc(unknown), %arg266: tensor<512xf32> loc(unknown), %arg267: tensor<512x2048x1x1xf32> loc(unknown)) -> tensor<1x1000xf32> {
    %cst = stablehlo.constant dense<0.0204081628> : tensor<1x2048xf32> loc(#loc)
    %cst_0 = stablehlo.constant dense<0.000000e+00> : tensor<1x2048x7x7xf32> loc(#loc)
    %cst_1 = stablehlo.constant dense<0.000000e+00> : tensor<1x512x7x7xf32> loc(#loc)
    %cst_2 = stablehlo.constant dense<0.000000e+00> : tensor<1x512x14x14xf32> loc(#loc)
    %cst_3 = stablehlo.constant dense<0.000000e+00> : tensor<1x1024x14x14xf32> loc(#loc)
    %cst_4 = stablehlo.constant dense<0.000000e+00> : tensor<1x256x14x14xf32> loc(#loc)
    %cst_5 = stablehlo.constant dense<0.000000e+00> : tensor<1x256x28x28xf32> loc(#loc)
    %cst_6 = stablehlo.constant dense<0.000000e+00> : tensor<1x512x28x28xf32> loc(#loc)
    %cst_7 = stablehlo.constant dense<0.000000e+00> : tensor<1x128x28x28xf32> loc(#loc)
    %cst_8 = stablehlo.constant dense<0.000000e+00> : tensor<1x128x56x56xf32> loc(#loc)
    %cst_9 = stablehlo.constant dense<0.000000e+00> : tensor<1x256x56x56xf32> loc(#loc)
    %cst_10 = stablehlo.constant dense<0.000000e+00> : tensor<1x64x56x56xf32> loc(#loc)
    %cst_11 = stablehlo.constant dense<0.000000e+00> : tensor<1x64x112x112xf32> loc(#loc)
    %cst_12 = stablehlo.constant dense<0xFF800000> : tensor<f32> loc(#loc)
    %cst_13 = stablehlo.constant dense<0.000000e+00> : tensor<f32> loc(#loc)
    %0 = stablehlo.reshape %arg22 : (tensor<64xf32>) -> tensor<1x1x64xf32> loc(#loc)
    %1 = stablehlo.reshape %0 : (tensor<1x1x64xf32>) -> tensor<64xf32> loc(#loc)
    %2 = stablehlo.convolution(%arg27, %arg26) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {stride = [2, 2], pad = [[3, 3], [3, 3]]} {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<1x3x224x224xf32>, tensor<64x3x7x7xf32>) -> tensor<1x64x112x112xf32> loc(#loc)
    %3 = stablehlo.reshape %arg25 : (tensor<64xf32>) -> tensor<1x1x64xf32> loc(#loc)
    %4 = stablehlo.reshape %3 : (tensor<1x1x64xf32>) -> tensor<64xf32> loc(#loc)
    %5 = stablehlo.reshape %arg24 : (tensor<64xf32>) -> tensor<1x1x64xf32> loc(#loc)
    %6 = stablehlo.reshape %5 : (tensor<1x1x64xf32>) -> tensor<64xf32> loc(#loc)
    %7 = stablehlo.reshape %arg23 : (tensor<64xf32>) -> tensor<1x1x64xf32> loc(#loc)
    %8 = stablehlo.reshape %7 : (tensor<1x1x64xf32>) -> tensor<64xf32> loc(#loc)
    %9 = "stablehlo.batch_norm_inference"(%2, %4, %6, %8, %1) <{epsilon = 9.99999974E-6 : f32, feature_index = 1 : i64}> : (tensor<1x64x112x112xf32>, tensor<64xf32>, tensor<64xf32>, tensor<64xf32>, tensor<64xf32>) -> tensor<1x64x112x112xf32> loc(#loc)
    %10 = stablehlo.maximum %9, %cst_11 : tensor<1x64x112x112xf32> loc(#loc)
    %11 = stablehlo.pad %10, %cst_12, low = [0, 0, 1, 1], high = [0, 0, 1, 1], interior = [0, 0, 0, 0] : (tensor<1x64x112x112xf32>, tensor<f32>) -> tensor<1x64x114x114xf32> loc(#loc)
    %12 = "stablehlo.reduce_window"(%11, %cst_12) <{window_dimensions = array<i64: 1, 1, 3, 3>, window_strides = array<i64: 1, 1, 2, 2>}> ({
    ^bb0(%arg268: tensor<f32> loc(unknown), %arg269: tensor<f32> loc(unknown)):
      %606 = stablehlo.maximum %arg268, %arg269 : tensor<f32> loc(#loc)
      stablehlo.return %606 : tensor<f32> loc(#loc)
    }) : (tensor<1x64x114x114xf32>, tensor<f32>) -> tensor<1x64x56x56xf32> loc(#loc)
    %13 = stablehlo.reshape %arg17 : (tensor<256xf32>) -> tensor<1x1x256xf32> loc(#loc)
    %14 = stablehlo.reshape %13 : (tensor<1x1x256xf32>) -> tensor<256xf32> loc(#loc)
    %15 = stablehlo.reshape %arg38 : (tensor<64xf32>) -> tensor<1x1x64xf32> loc(#loc)
    %16 = stablehlo.reshape %15 : (tensor<1x1x64xf32>) -> tensor<64xf32> loc(#loc)
    %17 = stablehlo.reshape %arg33 : (tensor<64xf32>) -> tensor<1x1x64xf32> loc(#loc)
    %18 = stablehlo.reshape %17 : (tensor<1x1x64xf32>) -> tensor<64xf32> loc(#loc)
    %19 = stablehlo.reshape %arg28 : (tensor<256xf32>) -> tensor<1x1x256xf32> loc(#loc)
    %20 = stablehlo.reshape %19 : (tensor<1x1x256xf32>) -> tensor<256xf32> loc(#loc)
    %21 = stablehlo.reshape %arg53 : (tensor<64xf32>) -> tensor<1x1x64xf32> loc(#loc)
    %22 = stablehlo.reshape %21 : (tensor<1x1x64xf32>) -> tensor<64xf32> loc(#loc)
    %23 = stablehlo.reshape %arg48 : (tensor<64xf32>) -> tensor<1x1x64xf32> loc(#loc)
    %24 = stablehlo.reshape %23 : (tensor<1x1x64xf32>) -> tensor<64xf32> loc(#loc)
    %25 = stablehlo.reshape %arg43 : (tensor<256xf32>) -> tensor<1x1x256xf32> loc(#loc)
    %26 = stablehlo.reshape %25 : (tensor<1x1x256xf32>) -> tensor<256xf32> loc(#loc)
    %27 = stablehlo.reshape %arg68 : (tensor<64xf32>) -> tensor<1x1x64xf32> loc(#loc)
    %28 = stablehlo.reshape %27 : (tensor<1x1x64xf32>) -> tensor<64xf32> loc(#loc)
    %29 = stablehlo.reshape %arg63 : (tensor<64xf32>) -> tensor<1x1x64xf32> loc(#loc)
    %30 = stablehlo.reshape %29 : (tensor<1x1x64xf32>) -> tensor<64xf32> loc(#loc)
    %31 = stablehlo.reshape %arg58 : (tensor<256xf32>) -> tensor<1x1x256xf32> loc(#loc)
    %32 = stablehlo.reshape %31 : (tensor<1x1x256xf32>) -> tensor<256xf32> loc(#loc)
    %33 = stablehlo.reshape %arg12 : (tensor<512xf32>) -> tensor<1x1x512xf32> loc(#loc)
    %34 = stablehlo.reshape %33 : (tensor<1x1x512xf32>) -> tensor<512xf32> loc(#loc)
    %35 = stablehlo.reshape %arg83 : (tensor<128xf32>) -> tensor<1x1x128xf32> loc(#loc)
    %36 = stablehlo.reshape %35 : (tensor<1x1x128xf32>) -> tensor<128xf32> loc(#loc)
    %37 = stablehlo.reshape %arg78 : (tensor<128xf32>) -> tensor<1x1x128xf32> loc(#loc)
    %38 = stablehlo.reshape %37 : (tensor<1x1x128xf32>) -> tensor<128xf32> loc(#loc)
    %39 = stablehlo.reshape %arg73 : (tensor<512xf32>) -> tensor<1x1x512xf32> loc(#loc)
    %40 = stablehlo.reshape %39 : (tensor<1x1x512xf32>) -> tensor<512xf32> loc(#loc)
    %41 = stablehlo.reshape %arg98 : (tensor<128xf32>) -> tensor<1x1x128xf32> loc(#loc)
    %42 = stablehlo.reshape %41 : (tensor<1x1x128xf32>) -> tensor<128xf32> loc(#loc)
    %43 = stablehlo.reshape %arg93 : (tensor<128xf32>) -> tensor<1x1x128xf32> loc(#loc)
    %44 = stablehlo.reshape %43 : (tensor<1x1x128xf32>) -> tensor<128xf32> loc(#loc)
    %45 = stablehlo.reshape %arg88 : (tensor<512xf32>) -> tensor<1x1x512xf32> loc(#loc)
    %46 = stablehlo.reshape %45 : (tensor<1x1x512xf32>) -> tensor<512xf32> loc(#loc)
    %47 = stablehlo.reshape %arg113 : (tensor<128xf32>) -> tensor<1x1x128xf32> loc(#loc)
    %48 = stablehlo.reshape %47 : (tensor<1x1x128xf32>) -> tensor<128xf32> loc(#loc)
    %49 = stablehlo.reshape %arg108 : (tensor<128xf32>) -> tensor<1x1x128xf32> loc(#loc)
    %50 = stablehlo.reshape %49 : (tensor<1x1x128xf32>) -> tensor<128xf32> loc(#loc)
    %51 = stablehlo.reshape %arg103 : (tensor<512xf32>) -> tensor<1x1x512xf32> loc(#loc)
    %52 = stablehlo.reshape %51 : (tensor<1x1x512xf32>) -> tensor<512xf32> loc(#loc)
    %53 = stablehlo.reshape %arg128 : (tensor<128xf32>) -> tensor<1x1x128xf32> loc(#loc)
    %54 = stablehlo.reshape %53 : (tensor<1x1x128xf32>) -> tensor<128xf32> loc(#loc)
    %55 = stablehlo.reshape %arg123 : (tensor<128xf32>) -> tensor<1x1x128xf32> loc(#loc)
    %56 = stablehlo.reshape %55 : (tensor<1x1x128xf32>) -> tensor<128xf32> loc(#loc)
    %57 = stablehlo.reshape %arg118 : (tensor<512xf32>) -> tensor<1x1x512xf32> loc(#loc)
    %58 = stablehlo.reshape %57 : (tensor<1x1x512xf32>) -> tensor<512xf32> loc(#loc)
    %59 = stablehlo.reshape %arg7 : (tensor<1024xf32>) -> tensor<1x1x1024xf32> loc(#loc)
    %60 = stablehlo.reshape %59 : (tensor<1x1x1024xf32>) -> tensor<1024xf32> loc(#loc)
    %61 = stablehlo.reshape %arg143 : (tensor<256xf32>) -> tensor<1x1x256xf32> loc(#loc)
    %62 = stablehlo.reshape %61 : (tensor<1x1x256xf32>) -> tensor<256xf32> loc(#loc)
    %63 = stablehlo.reshape %arg138 : (tensor<256xf32>) -> tensor<1x1x256xf32> loc(#loc)
    %64 = stablehlo.reshape %63 : (tensor<1x1x256xf32>) -> tensor<256xf32> loc(#loc)
    %65 = stablehlo.reshape %arg133 : (tensor<1024xf32>) -> tensor<1x1x1024xf32> loc(#loc)
    %66 = stablehlo.reshape %65 : (tensor<1x1x1024xf32>) -> tensor<1024xf32> loc(#loc)
    %67 = stablehlo.reshape %arg158 : (tensor<256xf32>) -> tensor<1x1x256xf32> loc(#loc)
    %68 = stablehlo.reshape %67 : (tensor<1x1x256xf32>) -> tensor<256xf32> loc(#loc)
    %69 = stablehlo.reshape %arg153 : (tensor<256xf32>) -> tensor<1x1x256xf32> loc(#loc)
    %70 = stablehlo.reshape %69 : (tensor<1x1x256xf32>) -> tensor<256xf32> loc(#loc)
    %71 = stablehlo.reshape %arg148 : (tensor<1024xf32>) -> tensor<1x1x1024xf32> loc(#loc)
    %72 = stablehlo.reshape %71 : (tensor<1x1x1024xf32>) -> tensor<1024xf32> loc(#loc)
    %73 = stablehlo.reshape %arg173 : (tensor<256xf32>) -> tensor<1x1x256xf32> loc(#loc)
    %74 = stablehlo.reshape %73 : (tensor<1x1x256xf32>) -> tensor<256xf32> loc(#loc)
    %75 = stablehlo.reshape %arg168 : (tensor<256xf32>) -> tensor<1x1x256xf32> loc(#loc)
    %76 = stablehlo.reshape %75 : (tensor<1x1x256xf32>) -> tensor<256xf32> loc(#loc)
    %77 = stablehlo.reshape %arg163 : (tensor<1024xf32>) -> tensor<1x1x1024xf32> loc(#loc)
    %78 = stablehlo.reshape %77 : (tensor<1x1x1024xf32>) -> tensor<1024xf32> loc(#loc)
    %79 = stablehlo.reshape %arg188 : (tensor<256xf32>) -> tensor<1x1x256xf32> loc(#loc)
    %80 = stablehlo.reshape %79 : (tensor<1x1x256xf32>) -> tensor<256xf32> loc(#loc)
    %81 = stablehlo.reshape %arg183 : (tensor<256xf32>) -> tensor<1x1x256xf32> loc(#loc)
    %82 = stablehlo.reshape %81 : (tensor<1x1x256xf32>) -> tensor<256xf32> loc(#loc)
    %83 = stablehlo.reshape %arg178 : (tensor<1024xf32>) -> tensor<1x1x1024xf32> loc(#loc)
    %84 = stablehlo.reshape %83 : (tensor<1x1x1024xf32>) -> tensor<1024xf32> loc(#loc)
    %85 = stablehlo.reshape %arg203 : (tensor<256xf32>) -> tensor<1x1x256xf32> loc(#loc)
    %86 = stablehlo.reshape %85 : (tensor<1x1x256xf32>) -> tensor<256xf32> loc(#loc)
    %87 = stablehlo.reshape %arg198 : (tensor<256xf32>) -> tensor<1x1x256xf32> loc(#loc)
    %88 = stablehlo.reshape %87 : (tensor<1x1x256xf32>) -> tensor<256xf32> loc(#loc)
    %89 = stablehlo.reshape %arg193 : (tensor<1024xf32>) -> tensor<1x1x1024xf32> loc(#loc)
    %90 = stablehlo.reshape %89 : (tensor<1x1x1024xf32>) -> tensor<1024xf32> loc(#loc)
    %91 = stablehlo.reshape %arg218 : (tensor<256xf32>) -> tensor<1x1x256xf32> loc(#loc)
    %92 = stablehlo.reshape %91 : (tensor<1x1x256xf32>) -> tensor<256xf32> loc(#loc)
    %93 = stablehlo.reshape %arg213 : (tensor<256xf32>) -> tensor<1x1x256xf32> loc(#loc)
    %94 = stablehlo.reshape %93 : (tensor<1x1x256xf32>) -> tensor<256xf32> loc(#loc)
    %95 = stablehlo.reshape %arg208 : (tensor<1024xf32>) -> tensor<1x1x1024xf32> loc(#loc)
    %96 = stablehlo.reshape %95 : (tensor<1x1x1024xf32>) -> tensor<1024xf32> loc(#loc)
    %97 = stablehlo.reshape %arg2 : (tensor<2048xf32>) -> tensor<1x1x2048xf32> loc(#loc)
    %98 = stablehlo.reshape %97 : (tensor<1x1x2048xf32>) -> tensor<2048xf32> loc(#loc)
    %99 = stablehlo.reshape %arg233 : (tensor<512xf32>) -> tensor<1x1x512xf32> loc(#loc)
    %100 = stablehlo.reshape %99 : (tensor<1x1x512xf32>) -> tensor<512xf32> loc(#loc)
    %101 = stablehlo.reshape %arg228 : (tensor<512xf32>) -> tensor<1x1x512xf32> loc(#loc)
    %102 = stablehlo.reshape %101 : (tensor<1x1x512xf32>) -> tensor<512xf32> loc(#loc)
    %103 = stablehlo.reshape %arg223 : (tensor<2048xf32>) -> tensor<1x1x2048xf32> loc(#loc)
    %104 = stablehlo.reshape %103 : (tensor<1x1x2048xf32>) -> tensor<2048xf32> loc(#loc)
    %105 = stablehlo.reshape %arg248 : (tensor<512xf32>) -> tensor<1x1x512xf32> loc(#loc)
    %106 = stablehlo.reshape %105 : (tensor<1x1x512xf32>) -> tensor<512xf32> loc(#loc)
    %107 = stablehlo.reshape %arg243 : (tensor<512xf32>) -> tensor<1x1x512xf32> loc(#loc)
    %108 = stablehlo.reshape %107 : (tensor<1x1x512xf32>) -> tensor<512xf32> loc(#loc)
    %109 = stablehlo.reshape %arg238 : (tensor<2048xf32>) -> tensor<1x1x2048xf32> loc(#loc)
    %110 = stablehlo.reshape %109 : (tensor<1x1x2048xf32>) -> tensor<2048xf32> loc(#loc)
    %111 = stablehlo.reshape %arg263 : (tensor<512xf32>) -> tensor<1x1x512xf32> loc(#loc)
    %112 = stablehlo.reshape %111 : (tensor<1x1x512xf32>) -> tensor<512xf32> loc(#loc)
    %113 = stablehlo.reshape %arg258 : (tensor<512xf32>) -> tensor<1x1x512xf32> loc(#loc)
    %114 = stablehlo.reshape %113 : (tensor<1x1x512xf32>) -> tensor<512xf32> loc(#loc)
    %115 = stablehlo.reshape %arg253 : (tensor<2048xf32>) -> tensor<1x1x2048xf32> loc(#loc)
    %116 = stablehlo.reshape %115 : (tensor<1x1x2048xf32>) -> tensor<2048xf32> loc(#loc)
    %117 = stablehlo.convolution(%12, %arg42) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {} {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<1x64x56x56xf32>, tensor<64x64x1x1xf32>) -> tensor<1x64x56x56xf32> loc(#loc)
    %118 = stablehlo.reshape %arg41 : (tensor<64xf32>) -> tensor<1x1x64xf32> loc(#loc)
    %119 = stablehlo.reshape %118 : (tensor<1x1x64xf32>) -> tensor<64xf32> loc(#loc)
    %120 = stablehlo.reshape %arg40 : (tensor<64xf32>) -> tensor<1x1x64xf32> loc(#loc)
    %121 = stablehlo.reshape %120 : (tensor<1x1x64xf32>) -> tensor<64xf32> loc(#loc)
    %122 = stablehlo.reshape %arg39 : (tensor<64xf32>) -> tensor<1x1x64xf32> loc(#loc)
    %123 = stablehlo.reshape %122 : (tensor<1x1x64xf32>) -> tensor<64xf32> loc(#loc)
    %124 = "stablehlo.batch_norm_inference"(%117, %119, %121, %123, %16) <{epsilon = 9.99999974E-6 : f32, feature_index = 1 : i64}> : (tensor<1x64x56x56xf32>, tensor<64xf32>, tensor<64xf32>, tensor<64xf32>, tensor<64xf32>) -> tensor<1x64x56x56xf32> loc(#loc)
    %125 = stablehlo.maximum %124, %cst_10 : tensor<1x64x56x56xf32> loc(#loc)
    %126 = stablehlo.convolution(%125, %arg37) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {pad = [[1, 1], [1, 1]]} {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<1x64x56x56xf32>, tensor<64x64x3x3xf32>) -> tensor<1x64x56x56xf32> loc(#loc)
    %127 = stablehlo.reshape %arg36 : (tensor<64xf32>) -> tensor<1x1x64xf32> loc(#loc)
    %128 = stablehlo.reshape %127 : (tensor<1x1x64xf32>) -> tensor<64xf32> loc(#loc)
    %129 = stablehlo.reshape %arg35 : (tensor<64xf32>) -> tensor<1x1x64xf32> loc(#loc)
    %130 = stablehlo.reshape %129 : (tensor<1x1x64xf32>) -> tensor<64xf32> loc(#loc)
    %131 = stablehlo.reshape %arg34 : (tensor<64xf32>) -> tensor<1x1x64xf32> loc(#loc)
    %132 = stablehlo.reshape %131 : (tensor<1x1x64xf32>) -> tensor<64xf32> loc(#loc)
    %133 = "stablehlo.batch_norm_inference"(%126, %128, %130, %132, %18) <{epsilon = 9.99999974E-6 : f32, feature_index = 1 : i64}> : (tensor<1x64x56x56xf32>, tensor<64xf32>, tensor<64xf32>, tensor<64xf32>, tensor<64xf32>) -> tensor<1x64x56x56xf32> loc(#loc)
    %134 = stablehlo.maximum %133, %cst_10 : tensor<1x64x56x56xf32> loc(#loc)
    %135 = stablehlo.convolution(%134, %arg32) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {} {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<1x64x56x56xf32>, tensor<256x64x1x1xf32>) -> tensor<1x256x56x56xf32> loc(#loc)
    %136 = stablehlo.reshape %arg31 : (tensor<256xf32>) -> tensor<1x1x256xf32> loc(#loc)
    %137 = stablehlo.reshape %136 : (tensor<1x1x256xf32>) -> tensor<256xf32> loc(#loc)
    %138 = stablehlo.reshape %arg30 : (tensor<256xf32>) -> tensor<1x1x256xf32> loc(#loc)
    %139 = stablehlo.reshape %138 : (tensor<1x1x256xf32>) -> tensor<256xf32> loc(#loc)
    %140 = stablehlo.reshape %arg29 : (tensor<256xf32>) -> tensor<1x1x256xf32> loc(#loc)
    %141 = stablehlo.reshape %140 : (tensor<1x1x256xf32>) -> tensor<256xf32> loc(#loc)
    %142 = "stablehlo.batch_norm_inference"(%135, %137, %139, %141, %20) <{epsilon = 9.99999974E-6 : f32, feature_index = 1 : i64}> : (tensor<1x256x56x56xf32>, tensor<256xf32>, tensor<256xf32>, tensor<256xf32>, tensor<256xf32>) -> tensor<1x256x56x56xf32> loc(#loc)
    %143 = stablehlo.convolution(%12, %arg21) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {} {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<1x64x56x56xf32>, tensor<256x64x1x1xf32>) -> tensor<1x256x56x56xf32> loc(#loc)
    %144 = stablehlo.reshape %arg20 : (tensor<256xf32>) -> tensor<1x1x256xf32> loc(#loc)
    %145 = stablehlo.reshape %144 : (tensor<1x1x256xf32>) -> tensor<256xf32> loc(#loc)
    %146 = stablehlo.reshape %arg19 : (tensor<256xf32>) -> tensor<1x1x256xf32> loc(#loc)
    %147 = stablehlo.reshape %146 : (tensor<1x1x256xf32>) -> tensor<256xf32> loc(#loc)
    %148 = stablehlo.reshape %arg18 : (tensor<256xf32>) -> tensor<1x1x256xf32> loc(#loc)
    %149 = stablehlo.reshape %148 : (tensor<1x1x256xf32>) -> tensor<256xf32> loc(#loc)
    %150 = "stablehlo.batch_norm_inference"(%143, %145, %147, %149, %14) <{epsilon = 9.99999974E-6 : f32, feature_index = 1 : i64}> : (tensor<1x256x56x56xf32>, tensor<256xf32>, tensor<256xf32>, tensor<256xf32>, tensor<256xf32>) -> tensor<1x256x56x56xf32> loc(#loc)
    %151 = stablehlo.add %142, %150 : tensor<1x256x56x56xf32> loc(#loc)
    %152 = stablehlo.maximum %151, %cst_9 : tensor<1x256x56x56xf32> loc(#loc)
    %153 = stablehlo.convolution(%152, %arg57) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {} {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<1x256x56x56xf32>, tensor<64x256x1x1xf32>) -> tensor<1x64x56x56xf32> loc(#loc)
    %154 = stablehlo.reshape %arg56 : (tensor<64xf32>) -> tensor<1x1x64xf32> loc(#loc)
    %155 = stablehlo.reshape %154 : (tensor<1x1x64xf32>) -> tensor<64xf32> loc(#loc)
    %156 = stablehlo.reshape %arg55 : (tensor<64xf32>) -> tensor<1x1x64xf32> loc(#loc)
    %157 = stablehlo.reshape %156 : (tensor<1x1x64xf32>) -> tensor<64xf32> loc(#loc)
    %158 = stablehlo.reshape %arg54 : (tensor<64xf32>) -> tensor<1x1x64xf32> loc(#loc)
    %159 = stablehlo.reshape %158 : (tensor<1x1x64xf32>) -> tensor<64xf32> loc(#loc)
    %160 = "stablehlo.batch_norm_inference"(%153, %155, %157, %159, %22) <{epsilon = 9.99999974E-6 : f32, feature_index = 1 : i64}> : (tensor<1x64x56x56xf32>, tensor<64xf32>, tensor<64xf32>, tensor<64xf32>, tensor<64xf32>) -> tensor<1x64x56x56xf32> loc(#loc)
    %161 = stablehlo.maximum %160, %cst_10 : tensor<1x64x56x56xf32> loc(#loc)
    %162 = stablehlo.convolution(%161, %arg52) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {pad = [[1, 1], [1, 1]]} {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<1x64x56x56xf32>, tensor<64x64x3x3xf32>) -> tensor<1x64x56x56xf32> loc(#loc)
    %163 = stablehlo.reshape %arg51 : (tensor<64xf32>) -> tensor<1x1x64xf32> loc(#loc)
    %164 = stablehlo.reshape %163 : (tensor<1x1x64xf32>) -> tensor<64xf32> loc(#loc)
    %165 = stablehlo.reshape %arg50 : (tensor<64xf32>) -> tensor<1x1x64xf32> loc(#loc)
    %166 = stablehlo.reshape %165 : (tensor<1x1x64xf32>) -> tensor<64xf32> loc(#loc)
    %167 = stablehlo.reshape %arg49 : (tensor<64xf32>) -> tensor<1x1x64xf32> loc(#loc)
    %168 = stablehlo.reshape %167 : (tensor<1x1x64xf32>) -> tensor<64xf32> loc(#loc)
    %169 = "stablehlo.batch_norm_inference"(%162, %164, %166, %168, %24) <{epsilon = 9.99999974E-6 : f32, feature_index = 1 : i64}> : (tensor<1x64x56x56xf32>, tensor<64xf32>, tensor<64xf32>, tensor<64xf32>, tensor<64xf32>) -> tensor<1x64x56x56xf32> loc(#loc)
    %170 = stablehlo.maximum %169, %cst_10 : tensor<1x64x56x56xf32> loc(#loc)
    %171 = stablehlo.convolution(%170, %arg47) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {} {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<1x64x56x56xf32>, tensor<256x64x1x1xf32>) -> tensor<1x256x56x56xf32> loc(#loc)
    %172 = stablehlo.reshape %arg46 : (tensor<256xf32>) -> tensor<1x1x256xf32> loc(#loc)
    %173 = stablehlo.reshape %172 : (tensor<1x1x256xf32>) -> tensor<256xf32> loc(#loc)
    %174 = stablehlo.reshape %arg45 : (tensor<256xf32>) -> tensor<1x1x256xf32> loc(#loc)
    %175 = stablehlo.reshape %174 : (tensor<1x1x256xf32>) -> tensor<256xf32> loc(#loc)
    %176 = stablehlo.reshape %arg44 : (tensor<256xf32>) -> tensor<1x1x256xf32> loc(#loc)
    %177 = stablehlo.reshape %176 : (tensor<1x1x256xf32>) -> tensor<256xf32> loc(#loc)
    %178 = "stablehlo.batch_norm_inference"(%171, %173, %175, %177, %26) <{epsilon = 9.99999974E-6 : f32, feature_index = 1 : i64}> : (tensor<1x256x56x56xf32>, tensor<256xf32>, tensor<256xf32>, tensor<256xf32>, tensor<256xf32>) -> tensor<1x256x56x56xf32> loc(#loc)
    %179 = stablehlo.add %178, %152 : tensor<1x256x56x56xf32> loc(#loc)
    %180 = stablehlo.maximum %179, %cst_9 : tensor<1x256x56x56xf32> loc(#loc)
    %181 = stablehlo.convolution(%180, %arg72) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {} {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<1x256x56x56xf32>, tensor<64x256x1x1xf32>) -> tensor<1x64x56x56xf32> loc(#loc)
    %182 = stablehlo.reshape %arg71 : (tensor<64xf32>) -> tensor<1x1x64xf32> loc(#loc)
    %183 = stablehlo.reshape %182 : (tensor<1x1x64xf32>) -> tensor<64xf32> loc(#loc)
    %184 = stablehlo.reshape %arg70 : (tensor<64xf32>) -> tensor<1x1x64xf32> loc(#loc)
    %185 = stablehlo.reshape %184 : (tensor<1x1x64xf32>) -> tensor<64xf32> loc(#loc)
    %186 = stablehlo.reshape %arg69 : (tensor<64xf32>) -> tensor<1x1x64xf32> loc(#loc)
    %187 = stablehlo.reshape %186 : (tensor<1x1x64xf32>) -> tensor<64xf32> loc(#loc)
    %188 = "stablehlo.batch_norm_inference"(%181, %183, %185, %187, %28) <{epsilon = 9.99999974E-6 : f32, feature_index = 1 : i64}> : (tensor<1x64x56x56xf32>, tensor<64xf32>, tensor<64xf32>, tensor<64xf32>, tensor<64xf32>) -> tensor<1x64x56x56xf32> loc(#loc)
    %189 = stablehlo.maximum %188, %cst_10 : tensor<1x64x56x56xf32> loc(#loc)
    %190 = stablehlo.convolution(%189, %arg67) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {pad = [[1, 1], [1, 1]]} {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<1x64x56x56xf32>, tensor<64x64x3x3xf32>) -> tensor<1x64x56x56xf32> loc(#loc)
    %191 = stablehlo.reshape %arg66 : (tensor<64xf32>) -> tensor<1x1x64xf32> loc(#loc)
    %192 = stablehlo.reshape %191 : (tensor<1x1x64xf32>) -> tensor<64xf32> loc(#loc)
    %193 = stablehlo.reshape %arg65 : (tensor<64xf32>) -> tensor<1x1x64xf32> loc(#loc)
    %194 = stablehlo.reshape %193 : (tensor<1x1x64xf32>) -> tensor<64xf32> loc(#loc)
    %195 = stablehlo.reshape %arg64 : (tensor<64xf32>) -> tensor<1x1x64xf32> loc(#loc)
    %196 = stablehlo.reshape %195 : (tensor<1x1x64xf32>) -> tensor<64xf32> loc(#loc)
    %197 = "stablehlo.batch_norm_inference"(%190, %192, %194, %196, %30) <{epsilon = 9.99999974E-6 : f32, feature_index = 1 : i64}> : (tensor<1x64x56x56xf32>, tensor<64xf32>, tensor<64xf32>, tensor<64xf32>, tensor<64xf32>) -> tensor<1x64x56x56xf32> loc(#loc)
    %198 = stablehlo.maximum %197, %cst_10 : tensor<1x64x56x56xf32> loc(#loc)
    %199 = stablehlo.convolution(%198, %arg62) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {} {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<1x64x56x56xf32>, tensor<256x64x1x1xf32>) -> tensor<1x256x56x56xf32> loc(#loc)
    %200 = stablehlo.reshape %arg61 : (tensor<256xf32>) -> tensor<1x1x256xf32> loc(#loc)
    %201 = stablehlo.reshape %200 : (tensor<1x1x256xf32>) -> tensor<256xf32> loc(#loc)
    %202 = stablehlo.reshape %arg60 : (tensor<256xf32>) -> tensor<1x1x256xf32> loc(#loc)
    %203 = stablehlo.reshape %202 : (tensor<1x1x256xf32>) -> tensor<256xf32> loc(#loc)
    %204 = stablehlo.reshape %arg59 : (tensor<256xf32>) -> tensor<1x1x256xf32> loc(#loc)
    %205 = stablehlo.reshape %204 : (tensor<1x1x256xf32>) -> tensor<256xf32> loc(#loc)
    %206 = "stablehlo.batch_norm_inference"(%199, %201, %203, %205, %32) <{epsilon = 9.99999974E-6 : f32, feature_index = 1 : i64}> : (tensor<1x256x56x56xf32>, tensor<256xf32>, tensor<256xf32>, tensor<256xf32>, tensor<256xf32>) -> tensor<1x256x56x56xf32> loc(#loc)
    %207 = stablehlo.add %206, %180 : tensor<1x256x56x56xf32> loc(#loc)
    %208 = stablehlo.maximum %207, %cst_9 : tensor<1x256x56x56xf32> loc(#loc)
    %209 = stablehlo.convolution(%208, %arg87) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {} {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<1x256x56x56xf32>, tensor<128x256x1x1xf32>) -> tensor<1x128x56x56xf32> loc(#loc)
    %210 = stablehlo.reshape %arg86 : (tensor<128xf32>) -> tensor<1x1x128xf32> loc(#loc)
    %211 = stablehlo.reshape %210 : (tensor<1x1x128xf32>) -> tensor<128xf32> loc(#loc)
    %212 = stablehlo.reshape %arg85 : (tensor<128xf32>) -> tensor<1x1x128xf32> loc(#loc)
    %213 = stablehlo.reshape %212 : (tensor<1x1x128xf32>) -> tensor<128xf32> loc(#loc)
    %214 = stablehlo.reshape %arg84 : (tensor<128xf32>) -> tensor<1x1x128xf32> loc(#loc)
    %215 = stablehlo.reshape %214 : (tensor<1x1x128xf32>) -> tensor<128xf32> loc(#loc)
    %216 = "stablehlo.batch_norm_inference"(%209, %211, %213, %215, %36) <{epsilon = 9.99999974E-6 : f32, feature_index = 1 : i64}> : (tensor<1x128x56x56xf32>, tensor<128xf32>, tensor<128xf32>, tensor<128xf32>, tensor<128xf32>) -> tensor<1x128x56x56xf32> loc(#loc)
    %217 = stablehlo.maximum %216, %cst_8 : tensor<1x128x56x56xf32> loc(#loc)
    %218 = stablehlo.convolution(%217, %arg82) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {stride = [2, 2], pad = [[1, 1], [1, 1]]} {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<1x128x56x56xf32>, tensor<128x128x3x3xf32>) -> tensor<1x128x28x28xf32> loc(#loc)
    %219 = stablehlo.reshape %arg81 : (tensor<128xf32>) -> tensor<1x1x128xf32> loc(#loc)
    %220 = stablehlo.reshape %219 : (tensor<1x1x128xf32>) -> tensor<128xf32> loc(#loc)
    %221 = stablehlo.reshape %arg80 : (tensor<128xf32>) -> tensor<1x1x128xf32> loc(#loc)
    %222 = stablehlo.reshape %221 : (tensor<1x1x128xf32>) -> tensor<128xf32> loc(#loc)
    %223 = stablehlo.reshape %arg79 : (tensor<128xf32>) -> tensor<1x1x128xf32> loc(#loc)
    %224 = stablehlo.reshape %223 : (tensor<1x1x128xf32>) -> tensor<128xf32> loc(#loc)
    %225 = "stablehlo.batch_norm_inference"(%218, %220, %222, %224, %38) <{epsilon = 9.99999974E-6 : f32, feature_index = 1 : i64}> : (tensor<1x128x28x28xf32>, tensor<128xf32>, tensor<128xf32>, tensor<128xf32>, tensor<128xf32>) -> tensor<1x128x28x28xf32> loc(#loc)
    %226 = stablehlo.maximum %225, %cst_7 : tensor<1x128x28x28xf32> loc(#loc)
    %227 = stablehlo.convolution(%226, %arg77) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {} {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<1x128x28x28xf32>, tensor<512x128x1x1xf32>) -> tensor<1x512x28x28xf32> loc(#loc)
    %228 = stablehlo.reshape %arg76 : (tensor<512xf32>) -> tensor<1x1x512xf32> loc(#loc)
    %229 = stablehlo.reshape %228 : (tensor<1x1x512xf32>) -> tensor<512xf32> loc(#loc)
    %230 = stablehlo.reshape %arg75 : (tensor<512xf32>) -> tensor<1x1x512xf32> loc(#loc)
    %231 = stablehlo.reshape %230 : (tensor<1x1x512xf32>) -> tensor<512xf32> loc(#loc)
    %232 = stablehlo.reshape %arg74 : (tensor<512xf32>) -> tensor<1x1x512xf32> loc(#loc)
    %233 = stablehlo.reshape %232 : (tensor<1x1x512xf32>) -> tensor<512xf32> loc(#loc)
    %234 = "stablehlo.batch_norm_inference"(%227, %229, %231, %233, %40) <{epsilon = 9.99999974E-6 : f32, feature_index = 1 : i64}> : (tensor<1x512x28x28xf32>, tensor<512xf32>, tensor<512xf32>, tensor<512xf32>, tensor<512xf32>) -> tensor<1x512x28x28xf32> loc(#loc)
    %235 = stablehlo.convolution(%208, %arg16) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {stride = [2, 2]} {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<1x256x56x56xf32>, tensor<512x256x1x1xf32>) -> tensor<1x512x28x28xf32> loc(#loc)
    %236 = stablehlo.reshape %arg15 : (tensor<512xf32>) -> tensor<1x1x512xf32> loc(#loc)
    %237 = stablehlo.reshape %236 : (tensor<1x1x512xf32>) -> tensor<512xf32> loc(#loc)
    %238 = stablehlo.reshape %arg14 : (tensor<512xf32>) -> tensor<1x1x512xf32> loc(#loc)
    %239 = stablehlo.reshape %238 : (tensor<1x1x512xf32>) -> tensor<512xf32> loc(#loc)
    %240 = stablehlo.reshape %arg13 : (tensor<512xf32>) -> tensor<1x1x512xf32> loc(#loc)
    %241 = stablehlo.reshape %240 : (tensor<1x1x512xf32>) -> tensor<512xf32> loc(#loc)
    %242 = "stablehlo.batch_norm_inference"(%235, %237, %239, %241, %34) <{epsilon = 9.99999974E-6 : f32, feature_index = 1 : i64}> : (tensor<1x512x28x28xf32>, tensor<512xf32>, tensor<512xf32>, tensor<512xf32>, tensor<512xf32>) -> tensor<1x512x28x28xf32> loc(#loc)
    %243 = stablehlo.add %234, %242 : tensor<1x512x28x28xf32> loc(#loc)
    %244 = stablehlo.maximum %243, %cst_6 : tensor<1x512x28x28xf32> loc(#loc)
    %245 = stablehlo.convolution(%244, %arg102) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {} {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<1x512x28x28xf32>, tensor<128x512x1x1xf32>) -> tensor<1x128x28x28xf32> loc(#loc)
    %246 = stablehlo.reshape %arg101 : (tensor<128xf32>) -> tensor<1x1x128xf32> loc(#loc)
    %247 = stablehlo.reshape %246 : (tensor<1x1x128xf32>) -> tensor<128xf32> loc(#loc)
    %248 = stablehlo.reshape %arg100 : (tensor<128xf32>) -> tensor<1x1x128xf32> loc(#loc)
    %249 = stablehlo.reshape %248 : (tensor<1x1x128xf32>) -> tensor<128xf32> loc(#loc)
    %250 = stablehlo.reshape %arg99 : (tensor<128xf32>) -> tensor<1x1x128xf32> loc(#loc)
    %251 = stablehlo.reshape %250 : (tensor<1x1x128xf32>) -> tensor<128xf32> loc(#loc)
    %252 = "stablehlo.batch_norm_inference"(%245, %247, %249, %251, %42) <{epsilon = 9.99999974E-6 : f32, feature_index = 1 : i64}> : (tensor<1x128x28x28xf32>, tensor<128xf32>, tensor<128xf32>, tensor<128xf32>, tensor<128xf32>) -> tensor<1x128x28x28xf32> loc(#loc)
    %253 = stablehlo.maximum %252, %cst_7 : tensor<1x128x28x28xf32> loc(#loc)
    %254 = stablehlo.convolution(%253, %arg97) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {pad = [[1, 1], [1, 1]]} {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<1x128x28x28xf32>, tensor<128x128x3x3xf32>) -> tensor<1x128x28x28xf32> loc(#loc)
    %255 = stablehlo.reshape %arg96 : (tensor<128xf32>) -> tensor<1x1x128xf32> loc(#loc)
    %256 = stablehlo.reshape %255 : (tensor<1x1x128xf32>) -> tensor<128xf32> loc(#loc)
    %257 = stablehlo.reshape %arg95 : (tensor<128xf32>) -> tensor<1x1x128xf32> loc(#loc)
    %258 = stablehlo.reshape %257 : (tensor<1x1x128xf32>) -> tensor<128xf32> loc(#loc)
    %259 = stablehlo.reshape %arg94 : (tensor<128xf32>) -> tensor<1x1x128xf32> loc(#loc)
    %260 = stablehlo.reshape %259 : (tensor<1x1x128xf32>) -> tensor<128xf32> loc(#loc)
    %261 = "stablehlo.batch_norm_inference"(%254, %256, %258, %260, %44) <{epsilon = 9.99999974E-6 : f32, feature_index = 1 : i64}> : (tensor<1x128x28x28xf32>, tensor<128xf32>, tensor<128xf32>, tensor<128xf32>, tensor<128xf32>) -> tensor<1x128x28x28xf32> loc(#loc)
    %262 = stablehlo.maximum %261, %cst_7 : tensor<1x128x28x28xf32> loc(#loc)
    %263 = stablehlo.convolution(%262, %arg92) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {} {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<1x128x28x28xf32>, tensor<512x128x1x1xf32>) -> tensor<1x512x28x28xf32> loc(#loc)
    %264 = stablehlo.reshape %arg91 : (tensor<512xf32>) -> tensor<1x1x512xf32> loc(#loc)
    %265 = stablehlo.reshape %264 : (tensor<1x1x512xf32>) -> tensor<512xf32> loc(#loc)
    %266 = stablehlo.reshape %arg90 : (tensor<512xf32>) -> tensor<1x1x512xf32> loc(#loc)
    %267 = stablehlo.reshape %266 : (tensor<1x1x512xf32>) -> tensor<512xf32> loc(#loc)
    %268 = stablehlo.reshape %arg89 : (tensor<512xf32>) -> tensor<1x1x512xf32> loc(#loc)
    %269 = stablehlo.reshape %268 : (tensor<1x1x512xf32>) -> tensor<512xf32> loc(#loc)
    %270 = "stablehlo.batch_norm_inference"(%263, %265, %267, %269, %46) <{epsilon = 9.99999974E-6 : f32, feature_index = 1 : i64}> : (tensor<1x512x28x28xf32>, tensor<512xf32>, tensor<512xf32>, tensor<512xf32>, tensor<512xf32>) -> tensor<1x512x28x28xf32> loc(#loc)
    %271 = stablehlo.add %270, %244 : tensor<1x512x28x28xf32> loc(#loc)
    %272 = stablehlo.maximum %271, %cst_6 : tensor<1x512x28x28xf32> loc(#loc)
    %273 = stablehlo.convolution(%272, %arg117) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {} {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<1x512x28x28xf32>, tensor<128x512x1x1xf32>) -> tensor<1x128x28x28xf32> loc(#loc)
    %274 = stablehlo.reshape %arg116 : (tensor<128xf32>) -> tensor<1x1x128xf32> loc(#loc)
    %275 = stablehlo.reshape %274 : (tensor<1x1x128xf32>) -> tensor<128xf32> loc(#loc)
    %276 = stablehlo.reshape %arg115 : (tensor<128xf32>) -> tensor<1x1x128xf32> loc(#loc)
    %277 = stablehlo.reshape %276 : (tensor<1x1x128xf32>) -> tensor<128xf32> loc(#loc)
    %278 = stablehlo.reshape %arg114 : (tensor<128xf32>) -> tensor<1x1x128xf32> loc(#loc)
    %279 = stablehlo.reshape %278 : (tensor<1x1x128xf32>) -> tensor<128xf32> loc(#loc)
    %280 = "stablehlo.batch_norm_inference"(%273, %275, %277, %279, %48) <{epsilon = 9.99999974E-6 : f32, feature_index = 1 : i64}> : (tensor<1x128x28x28xf32>, tensor<128xf32>, tensor<128xf32>, tensor<128xf32>, tensor<128xf32>) -> tensor<1x128x28x28xf32> loc(#loc)
    %281 = stablehlo.maximum %280, %cst_7 : tensor<1x128x28x28xf32> loc(#loc)
    %282 = stablehlo.convolution(%281, %arg112) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {pad = [[1, 1], [1, 1]]} {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<1x128x28x28xf32>, tensor<128x128x3x3xf32>) -> tensor<1x128x28x28xf32> loc(#loc)
    %283 = stablehlo.reshape %arg111 : (tensor<128xf32>) -> tensor<1x1x128xf32> loc(#loc)
    %284 = stablehlo.reshape %283 : (tensor<1x1x128xf32>) -> tensor<128xf32> loc(#loc)
    %285 = stablehlo.reshape %arg110 : (tensor<128xf32>) -> tensor<1x1x128xf32> loc(#loc)
    %286 = stablehlo.reshape %285 : (tensor<1x1x128xf32>) -> tensor<128xf32> loc(#loc)
    %287 = stablehlo.reshape %arg109 : (tensor<128xf32>) -> tensor<1x1x128xf32> loc(#loc)
    %288 = stablehlo.reshape %287 : (tensor<1x1x128xf32>) -> tensor<128xf32> loc(#loc)
    %289 = "stablehlo.batch_norm_inference"(%282, %284, %286, %288, %50) <{epsilon = 9.99999974E-6 : f32, feature_index = 1 : i64}> : (tensor<1x128x28x28xf32>, tensor<128xf32>, tensor<128xf32>, tensor<128xf32>, tensor<128xf32>) -> tensor<1x128x28x28xf32> loc(#loc)
    %290 = stablehlo.maximum %289, %cst_7 : tensor<1x128x28x28xf32> loc(#loc)
    %291 = stablehlo.convolution(%290, %arg107) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {} {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<1x128x28x28xf32>, tensor<512x128x1x1xf32>) -> tensor<1x512x28x28xf32> loc(#loc)
    %292 = stablehlo.reshape %arg106 : (tensor<512xf32>) -> tensor<1x1x512xf32> loc(#loc)
    %293 = stablehlo.reshape %292 : (tensor<1x1x512xf32>) -> tensor<512xf32> loc(#loc)
    %294 = stablehlo.reshape %arg105 : (tensor<512xf32>) -> tensor<1x1x512xf32> loc(#loc)
    %295 = stablehlo.reshape %294 : (tensor<1x1x512xf32>) -> tensor<512xf32> loc(#loc)
    %296 = stablehlo.reshape %arg104 : (tensor<512xf32>) -> tensor<1x1x512xf32> loc(#loc)
    %297 = stablehlo.reshape %296 : (tensor<1x1x512xf32>) -> tensor<512xf32> loc(#loc)
    %298 = "stablehlo.batch_norm_inference"(%291, %293, %295, %297, %52) <{epsilon = 9.99999974E-6 : f32, feature_index = 1 : i64}> : (tensor<1x512x28x28xf32>, tensor<512xf32>, tensor<512xf32>, tensor<512xf32>, tensor<512xf32>) -> tensor<1x512x28x28xf32> loc(#loc)
    %299 = stablehlo.add %298, %272 : tensor<1x512x28x28xf32> loc(#loc)
    %300 = stablehlo.maximum %299, %cst_6 : tensor<1x512x28x28xf32> loc(#loc)
    %301 = stablehlo.convolution(%300, %arg132) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {} {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<1x512x28x28xf32>, tensor<128x512x1x1xf32>) -> tensor<1x128x28x28xf32> loc(#loc)
    %302 = stablehlo.reshape %arg131 : (tensor<128xf32>) -> tensor<1x1x128xf32> loc(#loc)
    %303 = stablehlo.reshape %302 : (tensor<1x1x128xf32>) -> tensor<128xf32> loc(#loc)
    %304 = stablehlo.reshape %arg130 : (tensor<128xf32>) -> tensor<1x1x128xf32> loc(#loc)
    %305 = stablehlo.reshape %304 : (tensor<1x1x128xf32>) -> tensor<128xf32> loc(#loc)
    %306 = stablehlo.reshape %arg129 : (tensor<128xf32>) -> tensor<1x1x128xf32> loc(#loc)
    %307 = stablehlo.reshape %306 : (tensor<1x1x128xf32>) -> tensor<128xf32> loc(#loc)
    %308 = "stablehlo.batch_norm_inference"(%301, %303, %305, %307, %54) <{epsilon = 9.99999974E-6 : f32, feature_index = 1 : i64}> : (tensor<1x128x28x28xf32>, tensor<128xf32>, tensor<128xf32>, tensor<128xf32>, tensor<128xf32>) -> tensor<1x128x28x28xf32> loc(#loc)
    %309 = stablehlo.maximum %308, %cst_7 : tensor<1x128x28x28xf32> loc(#loc)
    %310 = stablehlo.convolution(%309, %arg127) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {pad = [[1, 1], [1, 1]]} {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<1x128x28x28xf32>, tensor<128x128x3x3xf32>) -> tensor<1x128x28x28xf32> loc(#loc)
    %311 = stablehlo.reshape %arg126 : (tensor<128xf32>) -> tensor<1x1x128xf32> loc(#loc)
    %312 = stablehlo.reshape %311 : (tensor<1x1x128xf32>) -> tensor<128xf32> loc(#loc)
    %313 = stablehlo.reshape %arg125 : (tensor<128xf32>) -> tensor<1x1x128xf32> loc(#loc)
    %314 = stablehlo.reshape %313 : (tensor<1x1x128xf32>) -> tensor<128xf32> loc(#loc)
    %315 = stablehlo.reshape %arg124 : (tensor<128xf32>) -> tensor<1x1x128xf32> loc(#loc)
    %316 = stablehlo.reshape %315 : (tensor<1x1x128xf32>) -> tensor<128xf32> loc(#loc)
    %317 = "stablehlo.batch_norm_inference"(%310, %312, %314, %316, %56) <{epsilon = 9.99999974E-6 : f32, feature_index = 1 : i64}> : (tensor<1x128x28x28xf32>, tensor<128xf32>, tensor<128xf32>, tensor<128xf32>, tensor<128xf32>) -> tensor<1x128x28x28xf32> loc(#loc)
    %318 = stablehlo.maximum %317, %cst_7 : tensor<1x128x28x28xf32> loc(#loc)
    %319 = stablehlo.convolution(%318, %arg122) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {} {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<1x128x28x28xf32>, tensor<512x128x1x1xf32>) -> tensor<1x512x28x28xf32> loc(#loc)
    %320 = stablehlo.reshape %arg121 : (tensor<512xf32>) -> tensor<1x1x512xf32> loc(#loc)
    %321 = stablehlo.reshape %320 : (tensor<1x1x512xf32>) -> tensor<512xf32> loc(#loc)
    %322 = stablehlo.reshape %arg120 : (tensor<512xf32>) -> tensor<1x1x512xf32> loc(#loc)
    %323 = stablehlo.reshape %322 : (tensor<1x1x512xf32>) -> tensor<512xf32> loc(#loc)
    %324 = stablehlo.reshape %arg119 : (tensor<512xf32>) -> tensor<1x1x512xf32> loc(#loc)
    %325 = stablehlo.reshape %324 : (tensor<1x1x512xf32>) -> tensor<512xf32> loc(#loc)
    %326 = "stablehlo.batch_norm_inference"(%319, %321, %323, %325, %58) <{epsilon = 9.99999974E-6 : f32, feature_index = 1 : i64}> : (tensor<1x512x28x28xf32>, tensor<512xf32>, tensor<512xf32>, tensor<512xf32>, tensor<512xf32>) -> tensor<1x512x28x28xf32> loc(#loc)
    %327 = stablehlo.add %326, %300 : tensor<1x512x28x28xf32> loc(#loc)
    %328 = stablehlo.maximum %327, %cst_6 : tensor<1x512x28x28xf32> loc(#loc)
